var judgeList = ['강경표  민사38부', '강문경  형사13부', '강민구  민사29부', '강성훈  형사3부', '강승준  형사8부', '강완수  민사34부', '강주헌  민사7부', '견종철  행정1부', '고의영  민사19부', '공도일  민사16부', '곽윤경  형사13부', '구자헌  민사18부', '권기훈  민사2부', '권순남  민사2부', '권순형  민사37부', '김갑석  민사3부', '김관용  민사16부', '김광태  사법연구', '김구년  민사12부', '김대웅  형사7부', '김대현  민사22부', '김동건  민사29부', '김동오  민사25부', '김동완  형사11부', '김무신  행정2부', '김문석  형사4부', '김봉원  민사7부', '김상우  행정10부', '김상현  민사36부', '김세종  형사1부', '김수정  민사19부', '김승주  형사5부', '김시철  민사16부', '김영현  민사32부', '김용대  민사24부', '김용하  민사5부', '김우수  형사9부', '김우진  행정7부', '김유진  형사8부', '김윤선  민사4부', '김윤정  민사24부', '김인겸  형사1부', '김재형  민사8부', '김재호  민사11부', '김제욱  민사26부', '김종기  행정5부', '김종우  형사3부', '김주현  행정9부', '김진석  행정6부', '김태호  형사10부', '김형두  형사5부', '김형진  민사9부', '남양우  민사9부', '노재호  민사34부', '류재훈  민사29부', '문용선  행정3부', '문주형  행정3부', '민달기  민사4부', '민정석  행정9부', '민지현  민사23부', '박선준  행정4부', '박성윤  형사5부', '박성준  형사1부', '박순영  행정7부', '박영재  민사38부', '박영주  민사23부', '박재영  민사13부', '박재우  행정11부', '박지연  민사25부', '박해빈  행정11부', '박형남  행정6부', '박형준  형사10부', '박혜선  민사38부', '박효선  민사12부', '방웅환  민사6부', '배광국  행정5부', '배기열  행정11부', '배용준  형사4부', '배준현  민사30부', '배형원  민사27부', '백승엽  형사6부', '서경환  민사26부', '서삼희  민사15부', '설범식  민사8부', '성언주  형사12부', '성지용  조정총괄부', '성충용  민사14부', '손병원  민사6부', '손철우  민사30부', '송석봉  민사15부', '송혜정  행정5부', '신광렬  민사33부', '신민석  민사27부', '신숙희  행정8부', '신용호  민사33부', '신종오  형사2부', '심준보  민사3부', '심현지  민사40부', '안동철  민사19부', '양현주  행정2부', '여상훈  행정1부', '오경미  행정2부', '오석준  민사31부', '오영상  민사32부', '오영준  형사6부', '오현규  형사12부', '왕정옥  민사13부', '원익선  행정10부', '위광하  형사7부', '유경진  조정총괄부', '유상재  민사32부', '유헌종  민사8부', '윤성근  민사10부', '윤승은  민사1부', '윤종구  민사35부', '이강원  민사28부', '이경훈  형사10부', '이규진  사법연구', '이동근  민사15부', '이민걸  사법연구', '이범균  민사22부', '이상호  민사5부', '이수영  행정3부', '이숙연  행정6부', '이승영  행정4부', '이승윤  민사31부', '이승철  행정8부', '이영진  형사11부', '이영창  형사9부', '이완희  형사7부', '이원범  민사7부', '이원형  민사17부', '이은상  민사35부', '이재신  민사30부', '이재영  행정8부', '이정석  민사6부', '이정환  행정7부', '이정훈  민사26부', '이종기  민사27부', '이종석  수석부장', '이준명  민사17부', '이진만  민사23부', '이창형  민사9부', '이태종  사법연구', '이현우  행정4부', '이형근  민사24부', '이호재  행정9부', '임성근  민사12부', '임영철  민사25부', '임혜진  민사17부', '임효미  민사36부', '장석조  민사34부', '장준아  민사40부', '장철익  행정1부', '전휴재  민사33부', '정경근  민사37부', '정석종  민사20부', '정선재  민사18부', '정수진  민사10부', '정재오  형사9부', '정지영  민사10부', '정총령  민사3부', '정형식  형사13부', '조광국  민사35부', '조기열  민사28부', '조영철  형사3부', '조용현  민사20부', '조은래  민사11부', '조진구  민사20부', '조찬영  민사1부', '조한창  민사13부', '주선아  민사50부', '진광철  형사4부', '진상훈  형사6부', '진현민  민사22부', '차문호  형사2부', '차승환  민사2부', '최승원  민사18부', '최완주  법원장', '최한순  형사8부', '최항석  형사2부', '최현종  민사14부', '한규현  민사5부', '한소영  민사37부', '한창훈  행정10부', '허부열  민사14부', '허상진  민사31부', '홍동기  형사12부', '홍성욱  형사11부', '홍승구  민사28부', '홍승면  민사4부', '홍지영  민사11부', '황병하  민사36부', '황승태  민사1부', '황의동  민사50부', '강경언  법원보안관리대', '강구율  형사과', '강나리  총무과', '강민태  법원보안관리대', '강복승  법원보안관리대', '강상우  민사12부', '강선의  시설과', '강성애  형사과', '강소혜  민사14부', '강숙희  민사1과', '강은정  민사2과', '강재원  행정과', '강호  형사8부', '강화현  민사7부', '강희창  감사담당관실', '고미진  민사1과', '고수미  민사1과', '고운진  법원보안관리대', '고이환  법원보안관리대', '고준경  민사2과', '고창성  법원보안관리대', '고혜신  형사과장', '고혜영  민사2과', '곽신재  민사18부', '곽혜진  민사1과', '구유미  민사1과', '권겸  행정6부', '권동훈  총무과', '권동희  민사2과', '권미정  민사1과', '권민수  법원보안관리대', '권민재  총무과', '권원명  형사9부', '권원태  행정과', '권정아  민사1과', '권형수  행정10부', '기미정  민사1과', '김가영  형사과(주사보)', '김가영  형사과(서기보)', '김경민  형사과', '김경하  민사2과', '김경헌  민사1과', '김관형  형사과', '김광선  총무과', '김광진  민사2과', '김광진  총무과', '김금숙  민사1과', '김기선  차량행정지원실', '김기성  감사담당관실', '김기운  법원보안관리대', '김나영  형사과', '김나정  형사7부', '김남식  법원보안관리대', '김남홍  민사11부', '김다래  총무과', '김단희  민사1과', '김대영  관리과', '김대천  민사1과', '김도형  민사22부', '김동수  총무과', '김동일  행정2부', '김동호  형사12부', '김동환  차량행정지원실', '김두현  행정과', '김만각  총무과', '김명옥  민사1과', '김미숙  행정과', '김미정  민사2과', '김민경  민사2과', '김민서  행정과', '김민아  형사과', '김민정  민사2과', '김민지  민사2과', '김민지  형사과', '김민한  차량행정지원실(휴직)', '김병숙  민사1과', '김보라  총무과', '김보라  민사2과', '김보운  민사31부', '김봉준  감사담당관실', '김석찬  법원보안관리대', '김성배  법원보안관리대', '김성자  민사2과', '김성자  행정과', '김성홍  법원보안관리대', '김소영  민사2과', '김소정  민사50부', '김수경  민사1과', '김수진  도서관', '김순덕  민사1과', '김순미  민사2과', '김순옥  민사1과', '김승주  시설과', '김연아  행정과', '김연희  형사과', '김영균  민사5부', '김영빈  법원보안관리대', '김영수  차량행정지원실', '김영희  민사2과', '김오순  총무과', '김완식  행정과', '김요한  법원보안관리대', '김용상  민사50부', '김용선  법원보안관리대', '김용주  행정과', '김우태  민사2과', '김웅기  총무과', '김원태  법원보안관리대', '김유정  민사2과', '김윤서  민사26부', '김은희  형사과', '김응래  법원보안관리대', '김자랑  민사2과', '김재빈  종합접수실', '김재석  행정9부', '김정규  시설과', '김정선  민사1과', '김종렬  민사2과', '김종완  민사8부', '김종필  민사1과', '김종하  민사1과', '김종훈  민사1과', '김종희  법원보안관리대', '김준우  총무과', '김준호  차량행정지원실', '김지수  민사15부', '김지연  민사38부', '김지영  행정1부', '김지현  형사과', '김지현  민사7부', '김진귀  총무과', '김진근  차량행정지원실', '김진년  관리과', '김진영  행정과', '김진우  민사2과', '김진주  법원보안관리대', '김진호  행정3부', '김찬신  법원보안관리대', '김창곤  민사1과', '김철호  법원보안관리대', '김철환  총무과', '김초롱  형사과', '김태진  관리과', '김태현  민사1과', '김태훈  민사6부', '김한수  민사36부', '김해영  기록관리센터', '김향순  민사2과', '김현숙  민사2과', '김현숙  형사과', '김현영  민사1과', '김현태  감사담당관실', '김형종  민사1과', '김혜정  법원보안관리대', '김호정  차량행정지원실', '김화종  시설과장', '김효선  민사26부', '김효정  행정과', '김희리  민사1과', '김희진  도서실', '나소정  민사1과', '나윤미  민사37부', '나은영  행정과', '남선애  민사2과', '남정현  민사2과', '노병갑  법원보안관리대', '노보람  형사과', '노용주  차량행정지원실', '노은진  민사2과', '노주성  법원보안관리대', '노한나  민사2과', '노환준  민사5부', '도영석  종합접수실', '도영준  법원보안관리대', '동한나  형사1부', '류길석  민사1과', '류대영  민사1과', '류원  민사2과', '류은애  민사2과', '류철호  법원보안관리대', '류형욱  민사2과', '명장식  차량행정지원실', '문대영  사무국장', '문병식  총무과', '문지현  민사13부', '문태은  총무과', '민병탁  법원보안관리대', '민수정  형사과', '박가혜  형사과', '박강숙  민사2과', '박계현  형사10부', '박광선  감사담당관실', '박기정  행정과', '박기철  총무과', '박기훈  차량행정지원실', '박라은  행정과', '박복현  차량행정지원실', '박상민  법원보안관리대', '박상엽  형사과', '박상용  법원보안관리대', '박상익  민사1과장', '박상훈  차량행정지원실', '박생규  형사과', '박선미  민사1과', '박선임  민사13부', '박성인  차량행정지원실', '박세영  형사과', '박소민  민사14부', '박소연  형사2부', '박수정  종합접수실', '박승우  민사2과', '박신영  행정과', '박영희  민사2과', '박은경  민사1과', '박은아  행정1부', '박은옥  법원보안관리대', '박은정  형사과', '박은진  민사1과', '박은혜  민사18부', '박인기  총무과', '박재성  민사20부', '박정섭  법원보안관리대', '박정용  기록관리센터', '박정훈  행정11부', '박종만  법원보안관리대', '박종현  관리과', '박종호  차량행정지원실', '박주인  관리과', '박지상  형사4부', '박지선  민사1과', '박지향  행정과', '박진수  민사33부', '박진영  민사1과', '박진욱  총무과', '박진호  행정8부', '박찬수  차량행정지원실', '박창주  법원보안관리대', '박한나  행정5부', '박현경  형사과', '박현기  총무과', '박현기  민사38부', '박형민  행정과', '박형호  차량행정지원실', '박혜련  행정10부', '박혜영  행정과', '박희열  법원보안관리대', '박희정  민사2과', '반혜정  총무과', '방형선  민사1과', '배미정  관리과', '배상혁  형사13부', '배영수  행정과', '배종빈  민사9부', '배준형  차량행정지원실', '백두식  형사과', '백송이  민사2부', '백은주  민사1과', '백장수  행정과', '백정선  형사과', '백중현  행정과', '변상진  법원보안관리대', '변원섭  법원보안관리대', '변종두  민사32부', '서만영  총무과', '서명희  형사과', '서성범  법원보안관리대', '서윤미  기록관리센터', '서진하  민사2과', '성기호  총무과', '성낙경  행정과장', '성수연  민사1과', '성정민  행정과', '성지원  민사8부', '성한호  총무과', '손귀숙  형사과', '손나리  민사2과', '손민정  민사2과', '손석수  법원보안관리대', '손수연  민사2과', '손정희  민사1과', '손채유  민사1부', '손태훈  민사1과', '송문용  행정과', '송수정  형사과', '송승만  종합접수실', '송을숙  민사1과', '송인원  민사2과', '송종훈  형사5부', '송진경  민사1과', '신경문  종합접수실', '신미숙  민사2과', '신성희  민사1과', '신은정  행정7부', '신일성  행정4부', '신정순  민사1과', '신정현  민사31부', '신진경  민사17부', '신철민  민사15부', '신태현  관리과', '심민선  차량행정지원실', '심비인  민사1과', '심이동  차량행정지원실', '심종숙  행정과', '안상우  행정과', '안세연  민사1과', '안주영  형사과', '안창기  민사1과', '안현호  행정과', '양경진  형사과', '양미  법원보안관리대', '양지윤  민사28부', '양지현  민사2과', '양형모  법원보안관리대', '엄재훈  민사1과', '엄행자  형사과', '연한수  법원보안관리대', '염민지  총무과', '염혜정  바로미건강', '예현정  형사과', '오가윤  행정과', '오경일  차량행정지원실', '오봉규  형사과', '오상희  바로미건강', '오수정  민사1과', '오수지  민사11부', '오태균  차량행정지원실', '우상오  민사1과', '우승희  총무과', '우은지  형사과', '우정훈  감사담당관실', '원성연  법원보안관리대', '원영태  법원보안관리대', '원인걸  법원보안관리대', '원채연  형사과', '유강석  차량행정지원실', '유기종  행정과', '유승만  민사1과', '유영인  차량행정지원실', '유예지  형사9부', '유우경  민사2과', '유은지  민사9부', '유정화  행정3부', '유준희  행정과', '유하식  법원보안관리대', '유현재  형사11부', '육현우  종합접수실', '윤경수  관리과', '윤성집  형사과', '윤수영  총무과', '윤수영  도서관(휴직)', '윤영아  종합접수실(휴직)', '윤은정  형사4부', '윤찬호  법원보안관리대', '윤창애  관리과', '윤태식  민사1과', '윤태웅  형사과', '윤한나  민사24부', '은주선  형사과', '이가경  형사과', '이강건  차량행정지원실', '이강남  민사2과', '이강희  법원보안관리대', '이경애  형사과', '이경재  민사10부', '이경주  행정4부', '이광서  법원보안관리대', '이금선  민사16부', '이길전  바로미심리', '이덕재  형사과', '이동엽  형사6부', '이두현  행정5부', '이명훈  행정과', '이명희  민사2과', '이미경  민사2과', '이미애  관리과', '이민선  민사1과', '이병국  시설과', '이병화  종합접수실', '이빛나  민사2과', '이사라  민사1과', '이서영  형사13부', '이선균  차량행정지원실', '이성향  형사과', '이세은  민사1과', '이세진  민사1과', '이소론  민사30부', '이소윤  민사2과', '이수진  민사1과', '이수현  형사3부', '이순선  형사과', '이슬아  민사25부', '이승욱  민사29부', '이승호  법원보안관리대', '이시우  법원보안관리대', '이시정  민사1과', '이양희  민사1과', '이연수  민사1과', '이연주  행정과', '이영로  차량행정지원실', '이영선  민사2과', '이영순  관리과', '이영주  민사3부', '이영주  민사24부', '이예솔  민사4부', '이용상  법원보안관리대', '이용섭  민사2과', '이용운  총무과', '이원국  관리과', '이유영  민사33부', '이유지  민사23부', '이유진  민사3부', '이윤숙  민사2과', '이윤창  법원보안관리대', '이윤철  시설과', '이은비  행정7부', '이은재  도서실', '이인기  종합접수실', '이장영  행정과', '이재규  민사19부', '이재명  법원보안관리대', '이재선  행정과', '이재승  민사1과', '이재열  민사2과', '이재욱  차량행정지원실', '이재현  총무과', '이정식  종합접수실', '이정아  민사2과', '이정희  행정과', '이종민  형사과', '이종엽  총무과', '이종은  행정8부', '이종훈  차량행정지원실', '이주연  형사과', '이주영  차량행정지원실', '이주현  법원보안관리대', '이주화  감사담당관실', '이준걸  차량행정지원실', '이준수  형사과', '이준희  종합접수실', '이지은  민사2과', '이지인  민사2과', '이지혜  행정2부', '이진규  민사1부', '이진범  종합접수실', '이충경  행정과', '이충한  법원보안관리대', '이태석  행정과', '이해진  차량행정지원실', '이현상  법원보안관리대', '이현석  차량행정지원실', '이현진  종합접수실', '이현철  형사과', '이현태  민사1과', '이형우  민사16부', '이형진  행정과', '이혜선  형사과', '이혜선  관리과', '이호근  민사2과', '이효영  법원보안관리대', '이흥식  법원보안관리대', '이희은  민사22부', '이희형  형사과', '인기창  총무과', '임강희  차량행정지원실', '임길원  행정과', '임덕현  민사1과', '임동순  민사1과', '임리영  행정과', '임미화  총무과', '임복희  민사2과', '임성민  감사담당관실', '임성환  민사1과', '임유정  형사과', '임인욱  민사35부', '임재연  형사과', '임준균  법원보안관리대', '임채환  총무과', '임현수  형사10부', '임형준  행정과', '임혜은  형사과', '임효순  민사2과', '임희창  법원보안관리대', '장다슬  행정6부', '장동혁  총무과', '장사철  차량행정지원실', '장세영  법원보안관리대', '장순덕  총무과', '장애리  민사1과', '장영진  법원보안관리대', '장영포  법원보안관리대', '장용호  법원보안관리대', '장재혁  종합접수실', '장재혁  형사2부', '장정숙  총무과', '장태신  관리과', '장하영  형사과', '장회진  법원보안관리대', '전광훈  차량행정지원실', '전민정  민사6부', '전선영  관리과', '전수산나  행정과', '전옥화  총무과', '전은철  차량행정지원실', '전해웅  행정11부', '전현진  민사17부', '전형준  차량행정지원실', '정경애  민사2과', '정경희  총무과', '정규근  차량행정지원실', '정명진  민사32부', '정미경  민사1과', '정민재  법원보안관리대', '정병회  민사2과', '정보람  민사2과', '정상헌  총무과', '정소정  민사2과', '정순원  종합접수실', '정영성  법원보안관리대', '정영필  형사과', '정예지  민사1과', '정용석  종합접수실', '정용은  민사1과', '정원철  법원보안관리대', '정재우  형사8부', '정주은  민사2과', '정진두  종합접수실', '정진섭  차량행정지원실', '정진아  민사2과', '정찬길  기록관리센터', '정하림  총무과', '정현기  민사34부', '정현정  형사과', '정효진  민사2과', '정희원  법원보안관리대', '제우호  관리과', '조경민  차량행정지원실', '조계천  법원보안관리대', '조광영  차량행정지원실', '조금광  시설과', '조동혁  민사1과', '조민희  민사2과', '조상호  차량행정지원실', '조순호  민사2과', '조영신  형사과', '조용복  법원보안관리대', '조은진  민사2과', '조은철  형사과', '조은혜  민사2과', '조재희  법원보안관리대', '조정용  행정9부', '조창식  관리과', '조현진  민사2과', '조효연  관리과', '조훈재  차량행정지원실', '주민선  민사1과', '주전규  민사1과', '주정옥  민사2과', '주현  차량행정지원실', '지길환  차량행정지원실', '지미연  행정과', '지영숙  행정과', '진수호  총무과', '진영민  법원보안관리대', '차현우  민사37부', '채기화  감사담당관실', '채선석  관리과', '채영림  형사12부', '채의석  법원보안관리대', '채정훈  법원보안관리대', '채지웅  민사23부', '천재필  형사7부', '최경애  종합접수실', '최경훈  차량행정지원실', '최동렬  차량행정지원실', '최동일  민사1과', '최명희  민사1과', '최민정  민사1과', '최보윤  민사35부', '최상용  법원보안관리대', '최선호  총무과', '최성락  민사50부', '최소라  관리과', '최양희  형사과', '최영숙  민사1과', '최오미  민사27부', '최유리  법원보안관리대', '최은경  민사2과', '최인순  종합접수실', '최장길  관리과장', '최정진  차량행정지원실', '최주리  법원보안관리대', '최주성  법원보안관리대', '최주연  민사1과', '최준규  법원보안관리대', '최준환  민사30부', '최지민  형사과', '최홍석  형사과', '최훈민  민사2과', '최희호  시설과', '추현정  민사1과', '탁지훈  감사담당관실', '하대호  법원보안관리대', '하민영  법원보안관리대', '하우정  형사6부', '하은혜  형사과', '하정성  총무과장', '한기애  민사2과', '한동원  차량행정지원실', '한만회  형사과', '한민경  행정과', '한아영  행정과', '한응도  종합접수실', '한정원  형사3부', '한태희  법원보안관리대', '한혜정  민사2과', '함성우  법원보안관리대', '허영숙  종합접수실', '현소영  형사과', '현승권  형사과', '형성욱  시설과', '홍사빈  형사11부', '홍석재  민사2과장', '홍성칠  법원보안관리대', '홍순건  민사28부', '홍자경  민사20부', '홍준식  차량행정지원실', '홍지현  법원보안관리대', '홍창의  관리과', '황계성  종합접수실', '황대환  총무과', '황미경  총무과', '황병수  민사2과', '황수현  법원보안관리대', '황승옥  형사과', '황영례  민사1과', '황원  법원보안관리대장', '황인재  민사2과', '황정현  형사1부', '황지윤  행정과', '황진영  형사5부', '황현석  차량행정지원실', '황혜련  민사40,형사20']

var findingList = judgeList;
var chosungList = ["ㄱ","ㄲ","ㄴ","ㄷ","ㄸ","ㄹ","ㅁ","ㅂ","ㅃ","ㅅ","ㅆ","ㅇ","ㅈ","ㅉ","ㅊ","ㅋ","ㅌ","ㅍ","ㅎ"];
function searchJudge(){
    var nameInput = document.getElementById("myInput").value;
    var display_name = "";
    // document.getElementById("judgeList").innerHTML = "You wrote: " + judgeList;
    if (nameInput == "") {
        findingList = judgeList;
        document.getElementById("judgeList").innerHTML = "CHARM-GONGIK";
        return;
    } else {
        findJudge(nameInput);
        display_names = "";
        findingList.forEach(
            function(value) {
               display_names += (value +"</br>");
            }
        )
        document.getElementById("judgeList").innerHTML = display_names;
    }
}

function isChosung(chosung_candi){
    if(chosungList.indexOf(chosung_candi) != -1) {
        return true;
    } else {
        return false;
    }
}
function toChosung(one_letter) {
    var nTmp=one_letter.charCodeAt(0) - 0xAC00;
    var jong=nTmp % 28; // 종성
    var jung=( (nTmp-jong)/28 ) % 21; // 중성
    var cho=( ( (nTmp-jong)/28 ) - jung ) / 21; // 초성
    return chosungList[cho];
}

function findJudge(nameInput) {
    var nameInputLength = nameInput.length;
    var tmpList = judgeList;
    var resultList = [];
    for( var i = 0; i < nameInputLength; i++) {
        resultList = [];
        // alert(resultList);
        if (isChosung(nameInput[i])) {
            tmpList.forEach(
                function(value) {
                    if (toChosung(value[i]) == nameInput[i]) {
                        resultList.push(value);
                    }
                }
            );
        } else {
            tmpList.forEach(
                function(value) {
                    if (value[i] == nameInput[i]) {
                        resultList.push(value);
                    }
                }
            );
        }
        tmpList = resultList;
    }
    // if (isChosung(nameInput[nameInputLength - 1])) {
    //     findingList.forEach(
    //         function(value) {
    //             if (toChosung(value[nameInputLength - 1]) == nameInput[nameInputLength - 1]) {
    //                 resultList.push(value);
    //             }
    //         }
    //     )
    // } else {
    //     findingList.forEach(
    //         function(value) {
    //             if (value[nameInputLength - 1] == nameInput[nameInputLength - 1]) {
    //                 resultList.push(value);
    //             }
    //         }
    //     )
    // }
    findingList = tmpList;
}

function clearSearch() {
    document.getElementById("myInput").value = "";
    document.getElementById("judgeList").innerHTML = "CHARM-GONGIK";
    document.getElementById("myInput").focus();
}
