var judgeList =['강경언  법정보안실', '강경언  법정보안실', '강민태  청사보안2실', '강복승  청사보안2실', '강상우  민사12부', '강선의  시설과', '강성애  형사9부', '강소혜  민사14부', '강숙희  민사15부', '강은정  민사2과', '강재원  행정과', '강호  형사8부', '강화현  민사7부', '강희창  감사과장님', '고미진  형사과', '고수미  민사1과', '고유나  헹장6부', '고이환  청사보안2실', '고창성  청사보안2실', '고혜영  형사과', '곽은영  민사2과', '곽혜진  민사1과', '구유미  민사1과', '국순영  종합접수실', '권겸  행정6부', '권동훈  민사2과', '권동희  민사28부', '권미정  민사4부', '권민수  청사보안1실', '권민재  총무과', '권영직  감사담당관실', '권영희  민사1과', '권원명  형사9부', '권원태  행정과', '권윤진  총무과', '권정아  민사1과', '권형수  행정10부', '기미정  민사1과', '김가영  민사2과', '김가영  형사과휴직', '김경민  형사7부', '김경하  민사29부', '김관형  형사과', '김광선  행정과', '김광진  총무과', '김광진  민사2과', '김금숙  민사1과', '김기선  차량행정지원실', '김기성  감사담당관실', '김기운  법정보안실', '김나영  형사과', '김나정  형사7부', '김남필  시설과장님', '김남홍  민사11부', '김다래  총무과', '김다미  형사과', '김단희  민사1과휴직', '김대영  관리과', '김대천  민사1과', '김도경  민사1과', '김동수  총무과', '김동일  행정2부', '김동호  형사12부', '김동화  민사19부', '김동환  차량행정지원실', '김두현  행정7부', '김만각  관리과', '김명옥  민사1과', '김미숙  행정과', '김미정  민사2과휴직', '김민경  민사17부', '김민서  행정과', '김민아  휴직', '김민지  민사2과', '김민지  형사과휴직', '김민한  휴직', '김병숙  민사1과', '김보라  총무과', '김보라  민사37부', '김봉준  감사담당관실', '김서현  총무과', '김석찬  청사보안1실', '김석화  민사27부', '김선호  형사과', '김성자  민사2과', '김성자  행정2부', '김성홍  청사보안2실', '김소영  민사2과', '김수경  형사5부', '김수진  도서실', '김수진  민사2과', '김순덕  민사1부', '김순미  민사18부', '김순옥  민사1과', '김승주  시설과', '김연아  민사2과', '김연지  민사12부', '김연희  형사과', '김영빈  청사보안2실', '김영수  차량행정지원실', '김영희  민사2과', '김오순  총무과', '김완식  행정과', '김왕규  행정과', '김요한  법정보안실', '김용상  민사50부', '김용주  행정과휴직', '김우태  형사과', '김웅기  총무과', '김원태  청사보안2실', '김유정  민사2과휴직', '김윤서  민사26부', '김은하  총무과', '김은희  형사13부', '김응래  청사보안1실', '김자랑  민사26부', '김재경  법정보안실', '김재빈  종합접수실', '김재석  행정9부', '김정곤  민사1과', '김정규  시설과', '김정선  민사1과휴직', '김종렬  민사2과', '김종필  민사1과', '김종하  민사1과', '김종훈  민사1과', '김종희  시설과', '김종희  청사보안2실', '김준우  총무과', '김준호  차량행정지원실', '김지수  민사15부', '김지연  민사38부', '김지영  행정1부', '김지현  형사3부', '김진국  관리과장님', '김진귀  민사1과', '김진근  차량행정지원실', '김진선  행정과휴직', '김진영  행정과', '김진우  형사과', '김진주  청사보안2실', '김진호  행정3부', '김찬신  청사보안2실', '김창곤  민사1과', '김철환  총무과', '김초롱  형사과', '김태진  관리과', '김태현  민사1과휴직', '김한수  민사36부', '김향순  민사2과', '김현  행정과', '김현정  민사1과', '김현태  감사담당관실', '김형종  민사1과', '김혜정  법정보안실', '김호정  차량행정지원실', '김효숙  수석부장실', '김효정  민사1과휴직', '김희경  민사1과', '김희리  형사과', '김희진  도서실', '나미연  청사보안1실', '나소정  형사과', '나은영  형사11부', '나정수  형사과', '남선애  민사2과', '남정현  총무과', '노병갑  청사보안2실', '노용주  차량행정지원실', '노은진  형사과휴직', '노주성  법정보안실', '노한나  민사2과', '노환준  민사5부', '동한나  형사1부', '류길석  민사1과(국소)', '류대영  민사1과(국소)', '류애정  행정과', '류철호  법정보안실', '마선곤  총무과', '명장식  차량행정지원실', '문대영  사무국장', '문병식  기록관리센터', '문주옥  민사1과', '문태은  총무과', '민병탁  청사보안2실', '민수정  형사과', '박가혜  민사32부', '박강숙  민사20부', '박경희  총무과', '박계현  형사10부', '박광선  감사담당관실', '박기정  민사2과', '박기철  형사과', '박기훈  차량행정지원실', '박라은  행정과휴직', '박미영  형사과휴직', '박민영  관리과', '박복현  차량행정지원실', '박상민  청사보안1실', '박상엽  형사과', '박상용  법정보안실', '박상훈  차량행정지원실', '박선미  민사6부', '박선임  민사13부', '박성인  차량행정지원실', '박세영  형사과', '박소연  형사2부', '박수정  종합접수실', '박승우  민사2과', '박신영  행정과', '박영희  민사24부', '박은경  형사과', '박은아  행정1부', '박은옥  법정보안실', '박은진  민사1과', '박은혜  민사18부', '박인기  형사과', '박정섭  청사보안2실', '박정용  기록관리센터', '박정훈  행정11부', '박종현  관리과', '박종호  차량행정지원실', '박주인  관리과', '박지상  형사4부', '박지선  종합접수실', '박지향  행정과', '박진수  민사33부', '박진영  민사1과', '박진욱  원장실', '박찬수  차량행정지원실', '박창주  청사보안1실', '박철진  종합접수실', '박한나  행정5부', '박현경  형사과', '박현기  관리과', '박현기  민사38부', '박형호  차량행정지원실', '박혜영  민사34부', '박희열  청사보안1실', '박희정  민사2과', '반혜정  수석부장실', '방형선  민사8부', '배상혁  형사13부', '배영수  행정과', '배종빈  민사9부', '배준형  차량행정지원실', '백송이  민사2부', '백은주  민사1과', '백정선  형사과', '백중현  행정과', '변상진  법정보안실', '변원섭  청사보안2실', '서경자  민사2과', '서만영  총무과', '서명희  형사과', '서성범  법정보안실', '서영선  민사36부', '서윤미  기록관리센터', '서인석  형사과', '서진하  민사2과', '성기호  총무과', '성낙경  행정과장님', '성수연  민사1과', '성지원  민사8부', '성한호  총무과', '소문정  형사과', '손나리  민사2과휴직', '손정희  민사1과', '손채유  민사1부', '손태훈  민사1과', '송문용  행정과', '송수정  형사과휴직', '송승만  종합접수실', '송심근  민사25부', '송인원  민사2과', '송종훈  형사5부', '송진경  민사1과', '신경문  종합접수실', '신명섭  법정보안실', '신성희  민사1과', '신일성  행정4부', '신정순  민사14부', '신정현  민사31부', '신진경  민사17부', '신철민  민사15부', '신태현  관리과', '심민선  차량행정지원실', '심비인  민사1과휴직', '심이동  차량행정지원실', '심종숙  행정과', '안상우  행정과', '안세연  민사13부', '안수민  행정9부', '안주영  형사12부', '안창기  민사1과', '안현호  형사과', '안희현  민사38부', '양경진  형사과휴직', '양미  법정보안실', '양지윤  민사28부', '양지현  형사과', '양형모  법정보안실', '엄재훈  민사1과(국소)', '엄행자  형사6부', '연한수  청사보안2실', '염민지  민사1과', '염혜정  바로미건강', '예현정  형사과', '오가윤  행정4부', '오경일  차량행정지원실', '오봉규  형사과', '오상희  바로미건강', '오수정  민사5부', '오주은  민사2과', '오태균  차량행정지원실', '오해주  총무과', '우상오  민사1과', '우은지  형사과', '우정훈  감사담당관실', '원성연  청사보안2실', '원영태  청사보안2실', '원인걸  법정보안실', '유강석  차량행정지원실', '유기종  행정과', '유삼  청사보안2실', '유승만  형사과', '유승환  파견', '유영인  차량행정지원실', '유예지  형사9부', '유우경  민사2과', '유정화  행정3부', '유준형  청사보안2실', '유준희  행정3부', '유하식  청사보안1실', '유현재  형사11부', '육현우  종합접수실', '윤경수  관리과', '윤민현  원장실', '윤성집  민사1과', '윤수영  휴직', '윤영아  접수실휴직', '윤은정  형사4부', '윤창애  관리과', '윤한나  민사24부', '은주선  형사과', '이가경  민사2과', '이강건  차량행정지원실', '이강남  민사2과', '이강희  청사보안1실', '이경애  형사과휴직', '이경재  민사10부', '이경주  행정4부', '이광서  청사보안2실', '이길전  복지센터', '이덕재  민사2과', '이동엽  형사6부', '이동훈  시설과', '이명훈  행정과', '이미애  관리과', '이민선  형사과', '이병국  시설과', '이병화  종합접수실', '이빛나  민사35부', '이서영  형사13부', '이선균  차량행정지원실', '이성향  형사2부', '이세은  민사1과휴직', '이세진  민사1과(국소)', '이소론  민사30부', '이소윤  민사2과', '이수진  민사16부', '이수현  형사3부', '이순선  형사과', '이슬아  민사25부', '이승석  민사2과', '이승욱  민사29부', '이승호  청사보안2실', '이시우  청사보안1실', '이시정  민사7부', '이양희  민사1과', '이영로  차량행정지원실', '이영선  민사2과', '이영순  관리과', '이영주  민사3부', '이예솔  민사4부', '이용상  법정보안실', '이용섭  민사2과', '이원국  관리과', '이유영  민사33부', '이유지  민사23부', '이윤숙  민사23부', '이윤창  법정보안실', '이은비  행정7부', '이은재  도서실', '이인기  종합접수실', '이장영  행정과', '이재규  민사19부', '이재명  청사보안1실', '이재선  파견', '이재승  민사1과(국소)', '이재열  파견', '이재욱  차량행정지원실', '이재천  민사2과과장님', '이재현  총무과', '이정아  민사2과', '이정희  행정1부', '이종민  행정과', '이종식  형사과', '이종엽  총무과', '이종은  행정8부', '이종훈  차량행정지원실', '이준걸  차량행정지원실', '이준희  종합접수실', '이지선  총무과', '이지은  민사2과', '이지인  민사2과', '이진  민사2과', '이진규  민사1부', '이진범  종합접수실', '이충경  민사2과휴직', '이충한  청사보안2실', '이태석  행정과', '이해진  차량행정지원실', '이현상  청사보안2실', '이현석  차량행정지원실', '이현진  종합접수실', '이현철  형사과', '이현태  민사1과', '이형우  민사16부', '이형진  민사2과', '이혜선  형사과휴직', '이호근  형사과', '이호영  형사과', '이효영  법정보안실', '이흥식  청사보안2실', '이희복  총무과장', '이희은  민사22부', '이희형  형사과', '인기창  행정과', '임강희  차량행정지원실', '임길원  민사2과', '임덕현  민사1과', '임동순  민사1과', '임리영  행정과', '임복희  민사25부', '임성민  감사담당관실', '임성일  민사1과', '임성환  민사1과', '임유정  형사1부', '임인욱  민사35부', '임재연  형사과', '임준균  청사보안2실', '임준택  청사보안2실', '임채환  총무과', '임현수  형사10부', '임형준  행정과', '임혜은  행정과', '임효순  민사31부', '임희창  법정보안실', '장다슬  행정6부', '장동혁  총무과', '장사철  차량행정지원실', '장선명  기록관리센터', '장세영  법정보안실', '장순덕  공보관실', '장애리  민사1과', '장영포  청사보안2실', '장용호  법정보안실', '장재혁  종합접수실', '장재혁  형사2부', '장태신  관리과휴직', '장하영  형사과', '장한백  청사보안2실', '장혜은  민사2과', '장회진  청사보안1실', '전광훈  차량행정지원실', '전민정  민사6부', '전선영  민사2과', '전수산나  행정5부', '전수진  행정11부', '전옥화  기자실', '전은철  차량행정지원실', '전형준  휴직', '정경애  민사22부', '정규근  차량행정지원실', '정명수  민사2과', '정명진  민사32부', '정미경  민사1과', '정민재  법정보안실', '정민지  행정과휴직', '정보람  민사2과', '정상헌  총무과', '정소정  민사2과', '정순원  종합접수실', '정영성  청사보안1실', '정영필  형사과', '정예지  민사1과', '정용은  민사1과', '정원철  법정보안실', '정위영  총무과', '정유정  민사1과', '정재우  형사8부', '정주은  민사2과', '정지인  행정10부', '정진두  종합접수실', '정진섭  차량행정지원실', '정진아  민사2과', '정찬길  기록관리센터', '정하림  민사1과', '정현기  민사34부', '정현숙  민사33부', '정현정  형사과', '정희원  청사보안2실', '제우호  관리과', '조경민  차량행정지원실', '조광영  차량행정지원실', '조동혁  민사1과', '조민영  청사보안1실', '조민희  민사2과', '조봉원  민사1과과장님', '조상호  차량행정지원실', '조순호  민사2과', '조영신  형사과', '조용복  청사보안2실', '조은정  형사10부', '조은진  민사2과', '조은철  형사과', '조은혜  민사1과휴직', '조은후  민사11부', '조재희  청사보안2실', '조정용  행정9부', '조창식  관리과', '조현진  민사2과', '조효연  관리과', '조훈재  차량행정지원실', '주민선  민사1과', '주전규  민사1과', '주정옥  민사30부', '주현   차량행정지원실', '지길환  차량행정지원실', '지미연  행정과', '지영숙  행정8부', '지혜선  관리과', '진소연  총무과', '진수호  총무과', '진영민  청사보안1실', '차보미  행정과', '차현우  민사37부', '채귀화  감사담당관실', '채선석  관리과', '채영림  형사12부', '채의석  법정보안실', '채정훈  법정보안실', '천재필  형사7부', '최경애  민사9부', '최경훈  차량행정지원실', '최광복  행정과', '최동렬  차량행정지원실', '최동일  형사과', '최명희  민사10부', '최상용  청사보안2실', '최선호  행정과', '최소라  관리과', '최양희  형사과휴직', '최오미  민사27부', '최유리  청사보안1실', '최윤석  시설과', '최인순  관리과', '최장길  형사과장님', '최정진  차량행정지원실', '최종윤  종합접수실', '최주리  법정보안실', '최주성  법정보안실', '최주연  민사1과', '최준규  청사보안2실', '최지민  형사8부', '최훈민  민사2과', '최희호  시설과', '추현정  민사1과', '탁지훈  감사담당관실', '하대호  청사보안1실', '하민형  청사보안2실', '하우정  형사6부', '하은혜  형사과휴직', '한동원  차량행정지원실', '한만회  종합접수실', '한민경  행정과', '한아영  행정과', '한응도  종합접수실', '한정원  형사3부', '한태희  청사보안2실', '함성우  법정보안실', '허영숙  형사과', '허은경  민사3부', '허은영  행정과', '허협  행정과', '현소영  형사4부', '형성욱  시설과', '홍민정  민사1과', '홍사빈  형사11부', '홍성칠  청사보안1실', '홍순건  민사28부', '홍연화  국장실', '홍자경  민사20부', '홍준식  차량행정지원실', '홍지현  법정보안실', '홍창의  관리과', '황계성  종합접수실', '황병수  민사2과', '황수현  청사보안1실', '황승옥  형사과', '황영례  민사2부', '황원  민사2과', '황인재  민사2과', '황정현  형사1부', '황진영  형사5부', '황현석  차량행정지원실', '황혜련  민사40부(형사20부)'];
var findingList = judgeList;
var chosungList = ["ㄱ","ㄲ","ㄴ","ㄷ","ㄸ","ㄹ","ㅁ","ㅂ","ㅃ","ㅅ","ㅆ","ㅇ","ㅈ","ㅉ","ㅊ","ㅋ","ㅌ","ㅍ","ㅎ"];
function searchJudge(){
    var nameInput = document.getElementById("myInput").value;
    var display_name = "";
    // document.getElementById("judgeList").innerHTML = "You wrote: " + judgeList;
    if (nameInput == "") {
        findingList = judgeList;
        document.getElementById("judgeList").innerHTML = "CHARM-GONGIK";
        return;
    } else {
        findJudge(nameInput);
        display_names = "";
        findingList.forEach(
            function(value) {
               display_names += (value +"</br>");
            }
        )
        document.getElementById("judgeList").innerHTML = display_names;
    }
}

function isChosung(chosung_candi){
    if(chosungList.indexOf(chosung_candi) != -1) {
        return true;
    } else {
        return false;
    }
}
function toChosung(one_letter) {
    var nTmp=one_letter.charCodeAt(0) - 0xAC00;
    var jong=nTmp % 28; // 종성
    var jung=( (nTmp-jong)/28 ) % 21; // 중성
    var cho=( ( (nTmp-jong)/28 ) - jung ) / 21; // 초성
    return chosungList[cho];
}

function findJudge(nameInput) {
    var nameInputLength = nameInput.length;
    var tmpList = judgeList;
    var resultList = [];
    for( var i = 0; i < nameInputLength; i++) {
        resultList = [];
        // alert(resultList);
        if (isChosung(nameInput[i])) {
            tmpList.forEach(
                function(value) {
                    if (toChosung(value[i]) == nameInput[i]) {
                        resultList.push(value);
                    }
                }
            );
        } else {
            tmpList.forEach(
                function(value) {
                    if (value[i] == nameInput[i]) {
                        resultList.push(value);
                    }
                }
            );
        }
        tmpList = resultList;
    }
    // if (isChosung(nameInput[nameInputLength - 1])) {
    //     findingList.forEach(
    //         function(value) {
    //             if (toChosung(value[nameInputLength - 1]) == nameInput[nameInputLength - 1]) {
    //                 resultList.push(value);
    //             }
    //         }
    //     )
    // } else {
    //     findingList.forEach(
    //         function(value) {
    //             if (value[nameInputLength - 1] == nameInput[nameInputLength - 1]) {
    //                 resultList.push(value);
    //             }
    //         }
    //     )
    // }
    findingList = tmpList;
}

function clearSearch() {
    document.getElementById("myInput").value = "";
    document.getElementById("judgeList").innerHTML = "CHARM-GONGIK";
    document.getElementById("myInput").focus();
}
